In [1]:
import pandas as pd
import sqlite3
import os

In [2]:
db = sqlite3.connect("Monarchs.db")

In [3]:
monarchs2001 = pd.read_csv("Data\Monarchs2001.csv")
monarchs2000 = pd.read_csv("Data\Monarchs2000.csv")
monarchs1999 = pd.read_csv("Data\Monarchs1999.csv")
monarchs1998 = pd.read_csv("Data\Monarchs1998.csv")
monarchs1997 = pd.read_csv("Data\Monarchs1997.csv")
monarchs1996 = pd.read_csv("Data\Monarchs1996.csv")
monarchs1995 = pd.read_csv("Data\Monarchs1995.csv")
monarchs1994 = pd.read_csv("Data\Monarchs1994.csv")


        #convert pandas to SQL table
monarchs2001.to_sql("Monarchs2001", db, if_exists="replace")
monarchs2000.to_sql("monarchs2000", db, if_exists="replace")
monarchs1999.to_sql("monarchs1999", db, if_exists="replace")
monarchs1998.to_sql("monarchs1998", db, if_exists="replace")
monarchs1997.to_sql("monarchs1997", db, if_exists="replace")
monarchs1996.to_sql("monarchs1996", db, if_exists="replace")
monarchs1995.to_sql("monarchs1995", db, if_exists="replace")
monarchs1994.to_sql("monarchs1994", db, if_exists="replace")

os.getcwd()

C:\Users\Arink\Anaconda3\lib\site-packages\pandas\core\generic.py:2712: UserWarning: The spaces in these column names will not be changed. In pandas versions < 0.14, spaces were converted to underscores.
  method=method,

'C:\\Users\\Arink\\Desktop\\github\\CodeLou\\Monarchs'

In [7]:
data_type = pd.read_sql('SELECT * FROM PRAGMA_TABLE_INFO("Monarchs2001")', db)
data_type

   cid            name     type  notnull dflt_value  pk
0    0           index  INTEGER        0       None   0
1    1         Tag No.     TEXT        0       None   0
2    2       Tag State     TEXT        0       None   0
3    3        Tag Date     TEXT        0       None   0
4    4    Report State     TEXT        0       None   0
5    5  Report Country     TEXT        0       None   0
6    6     Report Date     TEXT        0       None   0
7    7           Miles     REAL        0       None   0

In [8]:
monarchs2001

,Tag No.,Tag State,Tag Date,Report State,Report Country,Report Date,Miles
0,AAD929,MA,2001-09-12,Michoacán,MEXICO,2002-02-11,2344.0
1,AAD844,MA,2001-09-12,Michoacán,MEXICO,2002-03-08,2343.0
2,AIO261,NY,2001-09-24,Michoacán,MEXICO,2002-03-13,2329.0
3,AAU820,NY,2001-08-29,Michoacán,MEXICO,2002-02-27,2315.0
4,ABG581,NY,2001-09-16,Michoacán,MEXICO,2002-03-13,2303.0
...,...,...,...,...,...,...,...
1957,ADE225,NaN,NaN,MN,USA,2001-10-06,NaN
1958,ABW153,NaN,NaN,Michoacán,MEXICO,2002-03-08,NaN
1959,AJA875,NaN,NaN,Michoacán,MEXICO,2002-02-26,NaN
1960,ADR234,NaN,NaN,Michoacán,MEXICO,2002-02-26,NaN
1961,AAG669,NaN,NaN,CT,USA,2001-09-16,NaN